
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 2 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.POSTGRES_HOST-DESTINATION
  * module.single_database_source.azurerm_postgresql_server.postgres-paas
* Replace
  * module.flexible_database_destination.azurerm_postgresql_flexible_server.pgsql_server
  * module.flexible_database_destination.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.flexible_database_destination.azurerm_postgresql_flexible_server_database.pg_databases[&#34;toffee&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_HOST-DESTINATION will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST-DESTINATION" {
        id                      = "https://toffeesi-stg.vault.azure.net/secrets/recipe-backend-POSTGRES-HOST-DESTINATION/58ed6bc3287043a993c1ad3e28f7c1a7"
        name                    = "recipe-backend-POSTGRES-HOST-DESTINATION"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.flexible_database_destination.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      - delegated_subnet_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/postgresql" -> null # forces replacement
      ~ fqdn                          = "toffee-v14-flexible-destination-stg.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-v14-flexible-destination-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/toffee-v14-flexible-destination-stg" -> (known after apply)
        name                          = "toffee-v14-flexible-destination-stg"
      ~ private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com" -> (known after apply)
      ~ public_network_access_enabled = false -> (known after apply)
        tags                          = {
            "application"         = "core"
            "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Platform Operations"
        }
      - zone                          = "1" -> null
        # (10 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "3" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.flexible_database_destination.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-v14-flexible-destination-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/toffee-v14-flexible-destination-stg/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-v14-flexible-destination-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/toffee-v14-flexible-destination-stg" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.flexible_database_destination.azurerm_postgresql_flexible_server_database.pg_databases["toffee"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-v14-flexible-destination-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/toffee-v14-flexible-destination-stg/databases/toffee" -> (known after apply)
        name      = "toffee"
      ~ server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-v14-flexible-destination-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/toffee-v14-flexible-destination-stg" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.single_database_source.azurerm_postgresql_server.postgres-paas will be updated in-place
  ~ resource "azurerm_postgresql_server" "postgres-paas" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-v11-source-data-stg/providers/Microsoft.DBforPostgreSQL/servers/toffee-v11-source-stg"
        name                              = "toffee-v11-source-stg"
        tags                              = {
            "application"         = "core"
            "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Platform Operations"
        }
        # (16 unchanged attributes hidden)

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = false -> null
          - email_addresses      = [] -> null
          - enabled              = true -> null
          - retention_days       = 0 -> null
        }
    }

Plan: 3 to add, 2 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":297,"Program":"tfcmt","SHA1":"","Vars":{}} -->